tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1788_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1788_H_
#define _PIC16LF1788_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define RC0                           53
#define PORTC                         54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTE                         62
#define RE3                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define SSP1IF                        68
#define TXIF                          69
#define RCIF                          70
#define ADIF                          71
#define TMR1GIF                       72
#define PIR2                          73
#define CCP2IF                        74
#define C3IF                          75
#define C4IF                          76
#define BCL1IF                        77
#define EEIF                          78
#define C1IF                          79
#define C2IF                          80
#define OSFIF                         81
#define PIR3                          82
#define CCP3IF                        83
#define PIR4                          84
#define PSMC1SIF                      85
#define PSMC2SIF                      86
#define PSMC3SIF                      87
#define PSMC4SIF                      88
#define PSMC1TIF                      89
#define PSMC2TIF                      90
#define PSMC3TIF                      91
#define PSMC4TIF                      92
#define TMR0                          93
#define TMR1L                         94
#define TMR1H                         95
#define T1CON                         96
#define TMR1ON                        97
#define nT1SYNC                       98
#define T1OSCEN                       99
#define T1CKPS0                       100
#define T1CKPS                        101
#define T1CKPS1                       102
#define TMR1CS                        103
#define TMR1CS0                       104
#define TMR1CS1                       105
#define T1GCON                        106
#define T1GSS0                        107
#define T1GSS                         108
#define T1GSS1                        109
#define T1GVAL                        110
#define T1GGO                         111
#define T1GSPM                        112
#define T1GTM                         113
#define T1GPOL                        114
#define TMR1GE                        115
#define TMR2                          116
#define PR2                           117
#define T2CON                         118
#define T2CKPS0                       119
#define T2CKPS                        120
#define T2CKPS1                       121
#define TMR2ON                        122
#define T2OUTPS0                      123
#define T2OUTPS                       124
#define T2OUTPS1                      125
#define T2OUTPS2                      126
#define T2OUTPS3                      127
#define TRISA                         128
#define TRISA0                        129
#define TRISA1                        130
#define TRISA2                        131
#define TRISA3                        132
#define TRISA4                        133
#define TRISA5                        134
#define TRISA6                        135
#define TRISA7                        136
#define TRISB                         137
#define TRISB0                        138
#define TRISB1                        139
#define TRISB2                        140
#define TRISB3                        141
#define TRISB4                        142
#define TRISB5                        143
#define TRISB6                        144
#define TRISB7                        145
#define TRISC                         146
#define TRISC0                        147
#define TRISC1                        148
#define TRISC2                        149
#define TRISC3                        150
#define TRISC4                        151
#define TRISC5                        152
#define TRISC6                        153
#define TRISC7                        154
#define TRISE                         155
#define TRISE3                        156
#define PIE1                          157
#define TMR1IE                        158
#define TMR2IE                        159
#define CCP1IE                        160
#define SSP1IE                        161
#define TXIE                          162
#define RCIE                          163
#define ADIE                          164
#define TMR1GIE                       165
#define PIE2                          166
#define CCP2IE                        167
#define C3IE                          168
#define C4IE                          169
#define BCL1IE                        170
#define EEIE                          171
#define C1IE                          172
#define C2IE                          173
#define OSFIE                         174
#define PIE3                          175
#define CCP3IE                        176
#define PIE4                          177
#define PSMC1SIE                      178
#define PSMC2SIE                      179
#define PSMC3SIE                      180
#define PSMC4SIE                      181
#define PSMC1TIE                      182
#define PSMC2TIE                      183
#define PMSC3TIE                      184
#define PSMC3TIE                      185
#define PSMC4TIE                      186
#define OPTION_REG                    187
#define PS                            188
#define PS0                           189
#define PS1                           190
#define PS2                           191
#define PSA                           192
#define T0SE                          193
#define TMR0SE                        194
#define T0CS                          195
#define TMR0CS                        196
#define INTEDG                        197
#define nWPUEN                        198
#define PCON                          199
#define nBOR                          200
#define nPOR                          201
#define nRI                           202
#define nRMCLR                        203
#define nRWDT                         204
#define STKUNF                        205
#define STKOVF                        206
#define WDTCON                        207
#define SWDTEN                        208
#define WDTPS                         209
#define WDTPS0                        210
#define WDTPS1                        211
#define WDTPS2                        212
#define WDTPS3                        213
#define WDTPS4                        214
#define OSCTUNE                       215
#define TUN0                          216
#define TUN                           217
#define TUN1                          218
#define TUN2                          219
#define TUN3                          220
#define TUN4                          221
#define TUN5                          222
#define OSCCON                        223
#define SCS0                          224
#define SCS                           225
#define SCS1                          226
#define IRCF                          227
#define IRCF0                         228
#define IRCF1                         229
#define IRCF2                         230
#define IRCF3                         231
#define SPLLEN                        232
#define OSCSTAT                       233
#define HFIOFS                        234
#define LFIOFR                        235
#define MFIOFR                        236
#define HFIOFL                        237
#define HFIOFR                        238
#define OSTS                          239
#define PLLR                          240
#define T1OSCR                        241
#define ADRESL                        242
#define ADRESH                        243
#define ADCON0                        244
#define ADON                          245
#define GO_nDONE                      246
#define DONE                          247
#define GO                            248
#define ADGO                          249
#define CHS0                          250
#define CHS                           251
#define CHS1                          252
#define CHS2                          253
#define CHS3                          254
#define CHS4                          255
#define ADRMD                         256
#define ADCON1                        257
#define ADPREF0                       258
#define ADPREF                        259
#define ADPREF1                       260
#define ADNREF                        261
#define ADCS0                         262
#define ADCS                          263
#define ADCS1                         264
#define ADCS2                         265
#define ADFM                          266
#define ADCON2                        267
#define CHSN0                         268
#define CHSN                          269
#define CHSN1                         270
#define CHSN2                         271
#define CHSN3                         272
#define TRIGSEL                       273
#define TRIGSEL0                      274
#define TRIGSEL1                      275
#define TRIGSEL2                      276
#define TRIGSEL3                      277
#define LATA0                         278
#define LATA                          279
#define LATA1                         280
#define LATA2                         281
#define LATA3                         282
#define LATA4                         283
#define LATA5                         284
#define LATA6                         285
#define LATA7                         286
#define LATB0                         287
#define LATB                          288
#define LATB1                         289
#define LATB2                         290
#define LATB3                         291
#define LATB4                         292
#define LATB5                         293
#define LATB6                         294
#define LATB7                         295
#define LATC0                         296
#define LATC                          297
#define LATC1                         298
#define LATC2                         299
#define LATC3                         300
#define LATC4                         301
#define LATC5                         302
#define LATC6                         303
#define LATC7                         304
#define CM1CON0                       305
#define C1SYNC                        306
#define C1HYS                         307
#define C1SP                          308
#define C1ZLF                         309
#define C1POL                         310
#define C1OE                          311
#define C1OUT                         312
#define C1ON                          313
#define CM1CON1                       314
#define C1NCH0                        315
#define C1NCH                         316
#define C1NCH1                        317
#define C1NCH2                        318
#define C1PCH                         319
#define C1PCH0                        320
#define C1PCH1                        321
#define C1PCH2                        322
#define C1INTN                        323
#define C1INTP                        324
#define CM2CON0                       325
#define C2SYNC                        326
#define C2HYS                         327
#define C2SP                          328
#define C2ZLF                         329
#define C2POL                         330
#define C2OE                          331
#define C2OUT                         332
#define C2ON                          333
#define CM2CON1                       334
#define C2NCH0                        335
#define C2NCH                         336
#define C2NCH1                        337
#define C2NCH2                        338
#define C2PCH                         339
#define C2PCH0                        340
#define C2PCH1                        341
#define C2PCH2                        342
#define C2INTN                        343
#define C2INTP                        344
#define CMOUT                         345
#define MC1OUT                        346
#define MC2OUT                        347
#define MC3OUT                        348
#define MC4OUT                        349
#define BORCON                        350
#define BORRDY                        351
#define BORFS                         352
#define SBOREN                        353
#define FVRCON                        354
#define ADFVR0                        355
#define ADFVR                         356
#define ADFVR1                        357
#define CDAFVR0                       358
#define CDAFVR                        359
#define CDAFVR1                       360
#define TSRNG                         361
#define TSEN                          362
#define FVRRDY                        363
#define FVREN                         364
#define DAC1CON0                      365
#define DACNSS                        366
#define DAC1NSS                       367
#define DACPSS                        368
#define DACPSS0                       369
#define DAC1PSS                       370
#define DAC1PSS0                      371
#define DACPSS1                       372
#define DAC1PSS1                      373
#define DACOE0                        374
#define DAC1OE2                       375
#define DAC1OE1                       376
#define DACOE1                        377
#define DACEN                         378
#define DAC1EN                        379
#define DAC1CON1                      380
#define DAC1R                         381
#define DACR0                         382
#define DAC1R0                        383
#define DACR1                         384
#define DAC1R1                        385
#define DACR2                         386
#define DAC1R2                        387
#define DACR3                         388
#define DAC1R3                        389
#define DACR4                         390
#define DAC1R4                        391
#define DACR5                         392
#define DAC1R5                        393
#define DACR6                         394
#define DAC1R6                        395
#define DACR7                         396
#define DAC1R7                        397
#define CM4CON0                       398
#define C4SYNC                        399
#define C4HYS                         400
#define C4SP                          401
#define C4ZLF                         402
#define C4POL                         403
#define C4OE                          404
#define C4OUT                         405
#define C4ON                          406
#define CM4CON1                       407
#define C4NCH0                        408
#define C4NCH                         409
#define C4NCH1                        410
#define C4NCH2                        411
#define C4PCH0                        412
#define C4PCH                         413
#define C4PCH1                        414
#define C4PCH2                        415
#define C4INTN                        416
#define C4INTP                        417
#define APFCON2                       418
#define CCP3SEL                       419
#define SSSEL                         420
#define APFCON1                       421
#define CCP2SEL                       422
#define RXSEL                         423
#define TXSEL                         424
#define SDISEL                        425
#define SCKSEL                        426
#define SDOSEL                        427
#define CCP1SEL                       428
#define C2OUTSEL                      429
#define CM3CON0                       430
#define C3SYNC                        431
#define C3HYS                         432
#define C3SP                          433
#define C3ZLF                         434
#define C3POL                         435
#define C3OE                          436
#define C3OUT                         437
#define C3ON                          438
#define CM3CON1                       439
#define C3NCH                         440
#define C3NCH0                        441
#define C3NCH1                        442
#define C3NCH2                        443
#define C3PCH                         444
#define C3PCH0                        445
#define C3PCH1                        446
#define C3PCH2                        447
#define C3INTN                        448
#define C3INTP                        449
#define ANSA0                         450
#define ANSELA                        451
#define ANSA1                         452
#define ANSA2                         453
#define ANSA3                         454
#define ANSA4                         455
#define ANSA5                         456
#define ANSA7                         457
#define ANSB0                         458
#define ANSELB                        459
#define ANSB1                         460
#define ANSB2                         461
#define ANSB3                         462
#define ANSB4                         463
#define ANSB5                         464
#define ANSB6                         465
#define ANSELC                        466
#define ANSC0                         467
#define ANSC1                         468
#define ANSC2                         469
#define ANSC3                         470
#define ANSC4                         471
#define ANSC5                         472
#define ANSC6                         473
#define ANSC7                         474
#define EEADRL                        475
#define EEADRH                        476
#define EEDATL                        477
#define EEDATH                        478
#define EECON1                        479
#define RD                            480
#define WR                            481
#define WREN                          482
#define WRERR                         483
#define FREE                          484
#define LWLO                          485
#define CFGS                          486
#define EEPGD                         487
#define EECON2                        488
#define RC1REG                        489
#define TX1REG                        490
#define SP1BRGL                       491
#define SP1BRGH                       492
#define RC1STA                        493
#define RX9D                          494
#define OERR                          495
#define FERR                          496
#define ADDEN                         497
#define CREN                          498
#define SREN                          499
#define RX9                           500
#define SPEN                          501
#define TX1STA                        502
#define TX9D                          503
#define TRMT                          504
#define BRGH                          505
#define SENDB                         506
#define SYNC                          507
#define TXEN                          508
#define TX9                           509
#define CSRC                          510
#define BAUD1CON                      511
#define ABDEN                         512
#define WUE                           513
#define BRG16                         514
#define SCKP                          515
#define RCIDL                         516
#define ABDOVF                        517
#define WPUA0                         518
#define WPUA                          519
#define WPUA1                         520
#define WPUA2                         521
