tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1788_tdd.h
#define WPUA3                         522
#define WPUA4                         523
#define WPUA5                         524
#define WPUA6                         525
#define WPUA7                         526
#define WPUB0                         527
#define WPUB                          528
#define WPUB1                         529
#define WPUB2                         530
#define WPUB3                         531
#define WPUB4                         532
#define WPUB5                         533
#define WPUB6                         534
#define WPUB7                         535
#define WPUC0                         536
#define WPUC                          537
#define WPUC1                         538
#define WPUC2                         539
#define WPUC3                         540
#define WPUC4                         541
#define WPUC5                         542
#define WPUC6                         543
#define WPUC7                         544
#define WPUE                          545
#define WPUE3                         546
#define SSP1BUF                       547
#define BUF                           548
#define BUF0                          549
#define SSP1BUF0                      550
#define BUF1                          551
#define SSP1BUF1                      552
#define BUF2                          553
#define SSP1BUF2                      554
#define BUF3                          555
#define SSP1BUF3                      556
#define BUF4                          557
#define SSP1BUF4                      558
#define BUF5                          559
#define SSP1BUF5                      560
#define BUF6                          561
#define SSP1BUF6                      562
#define BUF7                          563
#define SSP1BUF7                      564
#define ADD0                          565
#define ADD                           566
#define SSP1ADD0                      567
#define SSP1ADD                       568
#define ADD1                          569
#define SSP1ADD1                      570
#define ADD2                          571
#define SSP1ADD2                      572
#define ADD3                          573
#define SSP1ADD3                      574
#define ADD4                          575
#define SSP1ADD4                      576
#define ADD5                          577
#define SSP1ADD5                      578
#define ADD6                          579
#define SSP1ADD6                      580
#define ADD7                          581
#define SSP1ADD7                      582
#define SSP1MSK0                      583
#define SSP1MSK                       584
#define MSK0                          585
#define MSK                           586
#define SSP1MSK1                      587
#define MSK1                          588
#define SSP1MSK2                      589
#define MSK2                          590
#define SSP1MSK3                      591
#define MSK3                          592
#define SSP1MSK4                      593
#define MSK4                          594
#define SSP1MSK5                      595
#define MSK5                          596
#define SSP1MSK6                      597
#define MSK6                          598
#define SSP1MSK7                      599
#define MSK7                          600
#define SSP1STAT                      601
#define BF                            602
#define UA                            603
#define R_nW                          604
#define S                             605
#define P                             606
#define D_nA                          607
#define CKE                           608
#define SMP                           609
#define SSP1CON1                      610
#define SSPM0                         611
#define SSPM                          612
#define SSPM1                         613
#define SSPM2                         614
#define SSPM3                         615
#define CKP                           616
#define SSPEN                         617
#define SSPOV                         618
#define WCOL                          619
#define SSP1CON2                      620
#define SEN                           621
#define RSEN                          622
#define PEN                           623
#define RCEN                          624
#define ACKEN                         625
#define ACKDT                         626
#define ACKSTAT                       627
#define GCEN                          628
#define SSP1CON3                      629
#define DHEN                          630
#define AHEN                          631
#define SBCDE                         632
#define SDAHT                         633
#define BOEN                          634
#define SCIE                          635
#define PCIE                          636
#define ACKTIM                        637
#define ODCONA0                       638
#define ODCONA                        639
#define ODCONA1                       640
#define ODCONA2                       641
#define ODCONA3                       642
#define ODCONA4                       643
#define ODCONA5                       644
#define ODCONA6                       645
#define ODCONA7                       646
#define ODCONB0                       647
#define ODCONB                        648
#define ODCONB1                       649
#define ODCONB2                       650
#define ODCONB3                       651
#define ODCONB4                       652
#define ODCONB5                       653
#define ODCONB6                       654
#define ODCONB7                       655
#define ODCONC0                       656
#define ODCONC                        657
#define ODCONC1                       658
#define ODCONC2                       659
#define ODCONC3                       660
#define ODCONC4                       661
#define ODCONC5                       662
#define ODCONC6                       663
#define ODCONC7                       664
#define CCPR1L                        665
#define CCPR1H                        666
#define CCP1CON                       667
#define CCP1M0                        668
#define CCP1M                         669
#define CCP1M1                        670
#define CCP1M2                        671
#define CCP1M3                        672
#define DC1B                          673
#define DC1B0                         674
#define DC1B1                         675
#define CCPR2L                        676
#define CCPR2H                        677
#define CCP2CON                       678
#define CCP2M                         679
#define CCP2M0                        680
#define CCP2M1                        681
#define CCP2M2                        682
#define CCP2M3                        683
#define DC2B0                         684
#define DC2B                          685
#define DC2B1                         686
#define SLRCONA0                      687
#define SLRCONA                       688
#define SLRCONA1                      689
#define SLRCONA2                      690
#define SLRCONA3                      691
#define SLRCONA4                      692
#define SLRCONA5                      693
#define SLRCONA6                      694
#define SLRCONA7                      695
#define SLRCONB                       696
#define SLRCONB0                      697
#define SLRCONB1                      698
#define SLRCONB2                      699
#define SLRCONB3                      700
#define SLRCONB4                      701
#define SLRCONB5                      702
#define SLRCONB6                      703
#define SLRCONB7                      704
#define SLRCONC                       705
#define SLRCONC0                      706
#define SLRCONC1                      707
#define SLRCONC2                      708
#define SLRCONC3                      709
#define SLRCONC4                      710
#define SLRCONC5                      711
#define SLRCONC6                      712
#define SLRCONC7                      713
#define CCPR3L                        714
#define CCPR3H                        715
#define CCP3CON                       716
#define CCP3M                         717
#define CCP3M0                        718
#define CCP3M1                        719
#define CCP3M2                        720
#define CCP3M3                        721
#define DC3B                          722
#define DC3B0                         723
#define DC3B1                         724
#define INLVLA                        725
#define INLVLA0                       726
#define INLVLA1                       727
#define INLVLA2                       728
#define INLVLA3                       729
#define INLVLA4                       730
#define INLVLA5                       731
#define INLVLA6                       732
#define INLVLA7                       733
#define INLVLB                        734
#define INLVLB0                       735
#define INLVLB1                       736
#define INLVLB2                       737
#define INLVLB3                       738
#define INLVLB4                       739
#define INLVLB5                       740
#define INLVLB6                       741
#define INLVLB7                       742
#define INLVLC                        743
#define INLVLC0                       744
#define INLVLC1                       745
#define INLVLC2                       746
#define INLVLC3                       747
#define INLVLC4                       748
#define INLVLC5                       749
#define INLVLC6                       750
#define INLVLC7                       751
#define INLVLE                        752
#define INLVLE3                       753
#define IOCAP                         754
#define IOCAP0                        755
#define IOCAP1                        756
#define IOCAP2                        757
#define IOCAP3                        758
#define IOCAP4                        759
#define IOCAP5                        760
#define IOCAP6                        761
#define IOCAP7                        762
#define IOCAN                         763
#define IOCAN0                        764
#define IOCAN1                        765
#define IOCAN2                        766
#define IOCAN3                        767
#define IOCAN4                        768
#define IOCAN5                        769
#define IOCAN6                        770
#define IOCAN7                        771
#define IOCAF0                        772
#define IOCAF                         773
#define IOCAF1                        774
#define IOCAF2                        775
#define IOCAF3                        776
#define IOCAF4                        777
#define IOCAF5                        778
#define IOCAF6                        779
#define IOCAF7                        780
#define IOCBP                         781
#define IOCBP0                        782
#define IOCBP1                        783
#define IOCBP2                        784
#define IOCBP3                        785
#define IOCBP4                        786
#define IOCBP5                        787
#define IOCBP6                        788
#define IOCBP7                        789
#define IOCBN0                        790
#define IOCBN                         791
#define IOCBN1                        792
#define IOCBN2                        793
#define IOCBN3                        794
#define IOCBN4                        795
#define IOCBN5                        796
#define IOCBN6                        797
#define IOCBN7                        798
#define IOCBF0                        799
#define IOCBF                         800
#define IOCBF1                        801
#define IOCBF2                        802
#define IOCBF3                        803
#define IOCBF4                        804
#define IOCBF5                        805
#define IOCBF6                        806
#define IOCBF7                        807
#define IOCCP0                        808
#define IOCCP                         809
#define IOCCP1                        810
#define IOCCP2                        811
#define IOCCP3                        812
#define IOCCP4                        813
#define IOCCP5                        814
#define IOCCP6                        815
#define IOCCP7                        816
#define IOCCN0                        817
#define IOCCN                         818
#define IOCCN1                        819
#define IOCCN2                        820
#define IOCCN3                        821
#define IOCCN4                        822
#define IOCCN5                        823
#define IOCCN6                        824
#define IOCCN7                        825
#define IOCCF0                        826
#define IOCCF                         827
#define IOCCF1                        828
#define IOCCF2                        829
#define IOCCF3                        830
#define IOCCF4                        831
#define IOCCF5                        832
#define IOCCF6                        833
#define IOCCF7                        834
#define IOCEP                         835
#define IOCEP3                        836
#define IOCEN                         837
#define IOCEN3                        838
#define IOCEF                         839
#define IOCEF3                        840
#define OPA1CON                       841
#define OPA1CON_PCH                   842
#define OPA1PCH                       843
#define OPA1CON_PCH0                  844
#define OPA1PCH0                      845
#define OPA1CON_PCH1                  846
#define OPA1PCH1                      847
#define OPA1PCH2                      848
#define OPA1CON_PCH2                  849
#define OPA1CON_SP                    850
#define OPA1SP                        851
#define OPA1CON_EN                    852
#define OPA1EN                        853
#define OPA2CON                       854
#define OPA2CON_PCH                   855
#define OPA2CON_PCH0                  856
#define OPA2PCH                       857
#define OPA2PCH0                      858
#define OPA2CON_PCH1                  859
#define OPA2PCH1                      860
#define OPA2CON_PCH2                  861
#define OPA2PCH2                      862
#define OPA2CON_SP                    863
#define OPA2SP                        864
#define OPA2EN                        865
#define OPA2CON_EN                    866
#define CLKRCON                       867
#define CLKRDIV                       868
#define CLKRDIV0                      869
#define CLKRDIV1                      870
#define CLKRDIV2                      871
#define CLKRDC                        872
#define CLKRDC0                       873
#define CLKRDC1                       874
#define CLKRSLR                       875
#define CLKROE                        876
#define CLKREN                        877
#define DAC2CON0                      878
#define DAC2PSS                       879
#define DAC2OE2                       880
#define DAC2OE1                       881
#define DAC2EN                        882
#define DAC2REF                       883
#define DAC2R                         884
#define DAC3CON0                      885
#define DAC3PSS                       886
#define DAC3OE2                       887
#define DAC3OE1                       888
#define DAC3EN                        889
#define DAC3REF                       890
#define DAC3R                         891
#define DAC4CON0                      892
#define DAC4PSS                       893
#define DAC4OE2                       894
#define DAC4OE1                       895
#define DAC4EN                        896
#define DAC4REF                       897
#define DAC4R                         898
#define PSMC1CON                      899
#define P1MODE                        900
#define P1MODE0                       901
#define P1MODE1                       902
#define P1MODE2                       903
#define P1MODE3                       904
#define P1DBRE                        905
#define P1DBFE                        906
#define PSMC1LD                       907
#define PSMC1EN                       908
#define PSMC1MDL                      909
#define P1MSRC0                       910
#define P1MSRC                        911
#define P1MSRC1                       912
#define P1MSRC2                       913
#define P1MSRC3                       914
#define P1MDLBIT                      915
#define P1MDLPOL                      916
#define P1MDLEN                       917
#define PSMC1SYNC                     918
#define P1SYNC0                       919
#define P1SYNC1                       920
#define P1SYNC2                       921
#define P1DCPOL                       922
#define P1PRPOL                       923
#define P1POFST                       924
#define PSMC1CLK                      925
#define P1CSRC                        926
#define P1CSRC0                       927
#define P1CSRC1                       928
#define P1CPRE                        929
#define P1CPRE0                       930
#define P1CPRE1                       931
#define PSMC1OEN                      932
#define P1OEA                         933
#define P1OEB                         934
#define P1OEC                         935
#define P1OED                         936
#define P1OEE                         937
#define P1OEF                         938
#define PSMC1POL                      939
#define P1POLA                        940
#define P1POLB                        941
#define P1POLC                        942
#define P1POLD                        943
#define P1POLE                        944
#define P1POLF                        945
#define P1INPOL                       946
#define PSMC1BLNK                     947
#define P1REBM                        948
#define P1REBM0                       949
#define P1REBM1                       950
#define P1FEBM0                       951
#define P1FEBM                        952
#define P1FEBM1                       953
#define PSMC1REBS                     954
#define P1REBSC1                      955
#define P1REBSC2                      956
#define P1REBSC3                      957
#define P1REBSC4                      958
#define P1REBSIN                      959
#define PSMC1FEBS                     960
#define P1FEBSC1                      961
#define P1FEBSC2                      962
#define P1FEBSC3                      963
#define P1FEBSC4                      964
#define P1FEBSIN                      965
#define PSMC1PHS                      966
#define P1PHST                        967
#define P1PHSC1                       968
#define P1PHSC2                       969
#define P1PHSC3                       970
#define P1PHSC4                       971
#define P1PHSIN                       972
#define PSMC1DCS                      973
#define P1DCST                        974
#define P1DCSC1                       975
#define P1DCSC2                       976
#define P1DCSC3                       977
#define P1DCSC4                       978
#define P1DCSIN                       979
#define PSMC1PRS                      980
#define P1PRST                        981
#define P1PRSC1                       982
#define P1PRSC2                       983
#define P1PRSC3                       984
#define P1PRSC4                       985
#define P1PRSIN                       986
#define PSMC1ASDC                     987
#define P1ASDOV                       988
#define P1ARSEN                       989
#define P1ASDEN                       990
#define P1ASE                         991
#define PSMC1ASDL                     992
#define P1ASDLA                       993
#define P1ASDLB                       994
#define P1ASDLC                       995
#define P1ASDLD                       996
#define P1ASDLE                       997
#define P1ASDLF                       998
#define PSMC1ASDS                     999
#define P1ASDSC1                      1000
#define P1ASDSC2                      1001
#define P1ASDSC3                      1002
#define P1ASDSC4                      1003
#define P1ASDSIN                      1004
#define PSMC1INT                      1005
#define P1TPRIF                       1006
#define P1TDCIF                       1007
#define P1TPHIF                       1008
#define P1TOVIF                       1009
#define P1TPRIE                       1010
#define P1TDCIE                       1011
#define P1TPHIE                       1012
#define P1TOVIE                       1013
#define PSMC1PHL                      1014
#define PSMC1PH0                      1015
#define PSMC1PH1                      1016
#define PSMC1PH2                      1017
#define PSMC1PH3                      1018
#define PSMC1PH4                      1019
#define PSMC1PH5                      1020
#define PSMC1PH6                      1021
#define PSMC1PH7                      1022
#define PSMC1PHH                      1023
#define PSMC1PH8                      1024
#define PSMC1PH9                      1025
#define PSMC1PH10                     1026
#define PSMC1PH11                     1027
#define PSMC1PH12                     1028
#define PSMC1PH13                     1029
#define PSMC1PH14                     1030
#define PSMC1PH15                     1031
#define PSMC1DCL                      1032
#define PSMC1DC0                      1033
#define PSMC1DC1                      1034
#define PSMC1DC2                      1035
#define PSMC1DC3                      1036
#define PSMC1DC4                      1037
#define PSMC1DC5                      1038
#define PSMC1DC6                      1039
#define PSMC1DC7                      1040
#define PSMC1DCH                      1041
#define PSMC1DC8                      1042
#define PSMC1DC9                      1043
#define PSMC1DC10                     1044
#define PSMC1DC11                     1045
#define PSMC1DC12                     1046
#define PSMC1DC13                     1047
#define PSMC1DC14                     1048
#define PSMC1DC15                     1049
#define PSMC1PRL                      1050
#define PSMC1PR0                      1051
#define PSMC1PR1                      1052
#define PSMC1PR2                      1053
#define PSMC1PR3                      1054
#define PSMC1PR4                      1055
#define PSMC1PR5                      1056
#define PSMC1PR6                      1057
#define PSMC1PR7                      1058
#define PSMC1PRH                      1059
#define PSMC1PR8                      1060
#define PSMC1PR9                      1061
#define PSMC1PR10                     1062
#define PSMC1PR11                     1063
#define PSMC1PR12                     1064
#define PSMC1PR13                     1065
#define PSMC1PR14                     1066
#define PSMC1PR15                     1067
#define PSMC1TMRL                     1068
#define PSMC1TMR0                     1069
#define PSMC1TMR1                     1070
#define PSMC1TMR2                     1071
#define PSMC1TMR3                     1072
#define PSMC1TMR4                     1073
#define PSMC1TMR5                     1074
#define PSMC1TMR6                     1075
#define PSMC1TMR7                     1076
#define PSMC1TMRH                     1077
#define PSMC1TMR8                     1078
#define PSMC1TMR9                     1079
#define PSMC1TMR10                    1080
#define PSMC1TMR11                    1081
#define PSMC1TMR12                    1082
#define PSMC1TMR13                    1083
#define PSMC1TMR14                    1084
#define PSMC1TMR15                    1085
#define PSMC1DBR                      1086
#define PSMC1DBR0                     1087
#define PSMC1DBR1                     1088
#define PSMC1DBR2                     1089
#define PSMC1DBR3                     1090
