tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1788_tdd.h
#define PSMC1DBR4                     1091
#define PSMC1DBR5                     1092
#define PSMC1DBR6                     1093
#define PSMC1DBR7                     1094
#define PSMC1DBF                      1095
#define PSMC1DBF0                     1096
#define PSMC1DBF1                     1097
#define PSMC1DBF2                     1098
#define PSMC1DBF3                     1099
#define PSMC1DBF4                     1100
#define PSMC1DBF5                     1101
#define PSMC1DBF6                     1102
#define PSMC1DBF7                     1103
#define PSMC1BLKR                     1104
#define PSMC1BLKR0                    1105
#define PSMC1BLKR1                    1106
#define PSMC1BLKR2                    1107
#define PSMC1BLKR3                    1108
#define PSMC1BLKR4                    1109
#define PSMC1BLKR5                    1110
#define PSMC1BLKR6                    1111
#define PSMC1BLKR7                    1112
#define PSMC1BLKF                     1113
#define PSMC1BLKF0                    1114
#define PSMC1BLKF1                    1115
#define PSMC1BLKF2                    1116
#define PSMC1BLKF3                    1117
#define PSMC1BLKF4                    1118
#define PSMC1BLKF5                    1119
#define PSMC1BLKF6                    1120
#define PSMC1BLKF7                    1121
#define PSMC1FFA                      1122
#define PSMC1FFA0                     1123
#define PSMC1FFA1                     1124
#define PSMC1FFA2                     1125
#define PSMC1FFA3                     1126
#define PSMC1STR0                     1127
#define P1STRA                        1128
#define P1STRB                        1129
#define P1STRC                        1130
#define P1STRD                        1131
#define P1STRE                        1132
#define P1STRF                        1133
#define PSMC1STR1                     1134
#define P1HSMEN                       1135
#define P1LSMEN                       1136
#define P1SSYNC                       1137
#define PSMC2CON                      1138
#define P2MODE                        1139
#define P2MODE0                       1140
#define P2MODE1                       1141
#define P2MODE2                       1142
#define P2MODE3                       1143
#define P2DBRE                        1144
#define P2DBFE                        1145
#define PSMC2LD                       1146
#define PSMC2EN                       1147
#define PSMC2MDL                      1148
#define P2MSRC                        1149
#define P2MSRC0                       1150
#define P2MSRC1                       1151
#define P2MSRC2                       1152
#define P2MSRC3                       1153
#define P2MDLBIT                      1154
#define P2MDLPOL                      1155
#define P2MDLEN                       1156
#define PSMC2SYNC                     1157
#define P2SYNC0                       1158
#define P2SYNC1                       1159
#define P2SYNC2                       1160
#define P2DCPOL                       1161
#define P2PRPOL                       1162
#define P2POFST                       1163
#define PSMC2CLK                      1164
#define P2CSRC0                       1165
#define P2CSRC                        1166
#define P2CSRC1                       1167
#define P2CPRE                        1168
#define P2CPRE0                       1169
#define P2CPRE1                       1170
#define PSMC2OEN                      1171
#define P2OEA                         1172
#define P2OEB                         1173
#define PSMC2POL                      1174
#define P2POLA                        1175
#define P2POLB                        1176
#define P2INPOL                       1177
#define PSMC2BLNK                     1178
#define P2REBM                        1179
#define P2REBM0                       1180
#define P2REBM1                       1181
#define P2FEBM0                       1182
#define P2FEBM                        1183
#define P2FEBM1                       1184
#define PSMC2REBS                     1185
#define P2REBSC1                      1186
#define P2REBSC2                      1187
#define P2REBSC3                      1188
#define P2REBSC4                      1189
#define P2REBSIN                      1190
#define PSMC2FEBS                     1191
#define P2FEBSC1                      1192
#define P2FEBSC2                      1193
#define P2FEBSC3                      1194
#define P2FEBSC4                      1195
#define P2FEBSIN                      1196
#define PSMC2PHS                      1197
#define P2PHST                        1198
#define P2PHSC1                       1199
#define P2PHSC2                       1200
#define P2PHSC3                       1201
#define P2PHSC4                       1202
#define P2PHSIN                       1203
#define PSMC2DCS                      1204
#define P2DCST                        1205
#define P2DCSC1                       1206
#define P2DCSC2                       1207
#define P2DCSC3                       1208
#define P2DCSC4                       1209
#define P2DCSIN                       1210
#define PSMC2PRS                      1211
#define P2PRST                        1212
#define P2PRSC1                       1213
#define P2PRSC2                       1214
#define P2PRSC3                       1215
#define P2PRSC4                       1216
#define P2PRSIN                       1217
#define PSMC2ASDC                     1218
#define P2ASDOV                       1219
#define P2ARSEN                       1220
#define P2ASDEN                       1221
#define P2ASE                         1222
#define PSMC2ASDL                     1223
#define P2ASDLA                       1224
#define P2ASDLB                       1225
#define PSMC2ASDS                     1226
#define P2ASDSC1                      1227
#define P2ASDSC2                      1228
#define P2ASDSC3                      1229
#define P2ASDSC4                      1230
#define P2ASDSIN                      1231
#define PSMC2INT                      1232
#define P2TPRIF                       1233
#define P2TDCIF                       1234
#define P2TPHIF                       1235
#define P2TOVIF                       1236
#define P2TPRIE                       1237
#define P2TDCIE                       1238
#define P2TPHIE                       1239
#define P2TOVIE                       1240
#define PSMC2PHL                      1241
#define PSMC2PH0                      1242
#define PSMC2PH1                      1243
#define PSMC2PH2                      1244
#define PSMC2PH3                      1245
#define PSMC2PH4                      1246
#define PSMC2PH5                      1247
#define PSMC2PH6                      1248
#define PSMC2PH7                      1249
#define PSMC2PHH                      1250
#define PSMC2PH8                      1251
#define PSMC2PH9                      1252
#define PSMC2PH10                     1253
#define PSMC2PH11                     1254
#define PSMC2PH12                     1255
#define PSMC2PH13                     1256
#define PSMC2PH14                     1257
#define PSMC2PH15                     1258
#define PSMC2DCL                      1259
#define PSMC2DC0                      1260
#define PSMC2DC1                      1261
#define PSMC2DC2                      1262
#define PSMC2DC3                      1263
#define PSMC2DC4                      1264
#define PSMC2DC5                      1265
#define PSMC2DC6                      1266
#define PSMC2DC7                      1267
#define PSMC2DCH                      1268
#define PSMC2DC8                      1269
#define PSMC2DC9                      1270
#define PSMC2DC10                     1271
#define PSMC2DC11                     1272
#define PSMC2DC12                     1273
#define PSMC2DC13                     1274
#define PSMC2DC14                     1275
#define PSMC2DC15                     1276
#define PSMC2PRL                      1277
#define PSMC2PR0                      1278
#define PSMC2PR1                      1279
#define PSMC2PR2                      1280
#define PSMC2PR3                      1281
#define PSMC2PR4                      1282
#define PSMC2PR5                      1283
#define PSMC2PR6                      1284
#define PSMC2PR7                      1285
#define PSMC2PRH                      1286
#define PSMC2PR8                      1287
#define PSMC2PR9                      1288
#define PSMC2PR10                     1289
#define PSMC2PR11                     1290
#define PSMC2PR12                     1291
#define PSMC2PR13                     1292
#define PSMC2PR14                     1293
#define PSMC2PR15                     1294
#define PSMC2TMRL                     1295
#define PSMC2TMR0                     1296
#define PSMC2TMR1                     1297
#define PSMC2TMR2                     1298
#define PSMC2TMR3                     1299
#define PSMC2TMR4                     1300
#define PSMC2TMR5                     1301
#define PSMC2TMR6                     1302
#define PSMC2TMR7                     1303
#define PSMC2TMRH                     1304
#define PSMC2TMR8                     1305
#define PSMC2TMR9                     1306
#define PSMC2TMR10                    1307
#define PSMC2TMR11                    1308
#define PSMC2TMR12                    1309
#define PSMC2TMR13                    1310
#define PSMC2TMR14                    1311
#define PSMC2TMR15                    1312
#define PSMC2DBR                      1313
#define PSMC2DBR0                     1314
#define PSMC2DBR1                     1315
#define PSMC2DBR2                     1316
#define PSMC2DBR3                     1317
#define PSMC2DBR4                     1318
#define PSMC2DBR5                     1319
#define PSMC2DBR6                     1320
#define PSMC2DBR7                     1321
#define PSMC2DBF                      1322
#define PSMC2DBF0                     1323
#define PSMC2DBF1                     1324
#define PSMC2DBF2                     1325
#define PSMC2DBF3                     1326
#define PSMC2DBF4                     1327
#define PSMC2DBF5                     1328
#define PSMC2DBF6                     1329
#define PSMC2DBF7                     1330
#define PSMC2BLKR                     1331
#define PSMC2BLKR0                    1332
#define PSMC2BLKR1                    1333
#define PSMC2BLKR2                    1334
#define PSMC2BLKR3                    1335
#define PSMC2BLKR4                    1336
#define PSMC2BLKR5                    1337
#define PSMC2BLKR6                    1338
#define PSMC2BLKR7                    1339
#define PSMC2BLKF                     1340
#define PSMC2BLKF0                    1341
#define PSMC2BLKF1                    1342
#define PSMC2BLKF2                    1343
#define PSMC2BLKF3                    1344
#define PSMC2BLKF4                    1345
#define PSMC2BLKF5                    1346
#define PSMC2BLKF6                    1347
#define PSMC2BLKF7                    1348
#define PSMC2FFA                      1349
#define PSMC2FFA0                     1350
#define PSMC2FFA1                     1351
#define PSMC2FFA2                     1352
#define PSMC2FFA3                     1353
#define PSMC2STR0                     1354
#define P2STRA                        1355
#define P2STRB                        1356
#define PSMC2STR1                     1357
#define P2HSMEN                       1358
#define P2LSMEN                       1359
#define P2SSYNC                       1360
#define PSMC3CON                      1361
#define P3MODE                        1362
#define P3MODE0                       1363
#define P3MODE1                       1364
#define P3MODE2                       1365
#define P3MODE3                       1366
#define P3DBRE                        1367
#define P3DBFE                        1368
#define PSMC3LD                       1369
#define PSMC3EN                       1370
#define PSMC3MDL                      1371
#define P3MSRC                        1372
#define P3MSRC0                       1373
#define P3MSRC1                       1374
#define P3MSRC2                       1375
#define P3MSRC3                       1376
#define P3MDLBIT                      1377
#define P3MDLPOL                      1378
#define P3MDLEN                       1379
#define PSMC3SYNC                     1380
#define P3SYNC0                       1381
#define P3SYNC1                       1382
#define P3SYNC2                       1383
#define P3DCPOL                       1384
#define P3PRPOL                       1385
#define P3POFST                       1386
#define PSMC3CLK                      1387
#define P3CSRC0                       1388
#define P3CSRC                        1389
#define P3CSRC1                       1390
#define P3CPRE                        1391
#define P3CPRE0                       1392
#define P3CPRE1                       1393
#define PSMC3OEN                      1394
#define P3OEA                         1395
#define P3OEB                         1396
#define PSMC3POL                      1397
#define P3POLA                        1398
#define P3POLB                        1399
#define P3INPOL                       1400
#define PSMC3BLNK                     1401
#define P3REBM                        1402
#define P3REBM0                       1403
#define P3REBM1                       1404
#define P3FEBM                        1405
#define P3FEBM0                       1406
#define P3FEBM1                       1407
#define PSMC3REBS                     1408
#define P3REBSC1                      1409
#define P3REBSC2                      1410
#define P3REBSC3                      1411
#define P3REBSC4                      1412
#define P3REBSIN                      1413
#define PSMC3FEBS                     1414
#define P3FEBSC1                      1415
#define P3FEBSC2                      1416
#define P3FEBSC3                      1417
#define P3FEBSC4                      1418
#define P3FEBSIN                      1419
#define PSMC3PHS                      1420
#define P3PHST                        1421
#define P3PHSC1                       1422
#define P3PHSC2                       1423
#define P3PHSC3                       1424
#define P3PHSC4                       1425
#define P3PHSIN                       1426
#define PSMC3DCS                      1427
#define P3DCST                        1428
#define P3DCSC1                       1429
#define P3DCSC2                       1430
#define P3DCSC3                       1431
#define P3DCSC4                       1432
#define P3DCSIN                       1433
#define PSMC3PRS                      1434
#define P3PRST                        1435
#define P3PRSC1                       1436
#define P3PRSC2                       1437
#define P3PRSC3                       1438
#define P3PRSC4                       1439
#define P3PRSIN                       1440
#define PSMC3ASDC                     1441
#define P3ASDOV                       1442
#define P3ARSEN                       1443
#define P3ASDEN                       1444
#define P3ASE                         1445
#define PSMC3ASDL                     1446
#define P3ASDLA                       1447
#define P3ASDLB                       1448
#define PSMC3ASDS                     1449
#define P3ASDSC1                      1450
#define P3ASDSC2                      1451
#define P3ASDSC3                      1452
#define P3ASDSC4                      1453
#define P3ASDSIN                      1454
#define PSMC3INT                      1455
#define P3TPRIF                       1456
#define P3TDCIF                       1457
#define P3TPHIF                       1458
#define P3TOVIF                       1459
#define P3TPRIE                       1460
#define P3TDCIE                       1461
#define P3TPHIE                       1462
#define P3TOVIE                       1463
#define PSMC3PHL                      1464
#define PSMC3PH0                      1465
#define PSMC3PH1                      1466
#define PSMC3PH2                      1467
#define PSMC3PH3                      1468
#define PSMC3PH4                      1469
#define PSMC3PH5                      1470
#define PSMC3PH6                      1471
#define PSMC3PH7                      1472
#define PSMC3PHH                      1473
#define PSMC3PH8                      1474
#define PSMC3PH9                      1475
#define PSMC3PH10                     1476
#define PSMC3PH11                     1477
#define PSMC3PH12                     1478
#define PSMC3PH13                     1479
#define PSMC3PH14                     1480
#define PSMC3PH15                     1481
#define PSMC3DCL                      1482
#define PSMC3DC0                      1483
#define PSMC3DC1                      1484
#define PSMC3DC2                      1485
#define PSMC3DC3                      1486
#define PSMC3DC4                      1487
#define PSMC3DC5                      1488
#define PSMC3DC6                      1489
#define PSMC3DC7                      1490
#define PSMC3DCH                      1491
#define PSMC3DC8                      1492
#define PSMC3DC9                      1493
#define PSMC3DC10                     1494
#define PSMC3DC11                     1495
#define PSMC3DC12                     1496
#define PSMC3DC13                     1497
#define PSMC3DC14                     1498
#define PSMC3DC15                     1499
#define PSMC3PRL                      1500
#define PSMC3PR0                      1501
#define PSMC3PR1                      1502
#define PSMC3PR2                      1503
#define PSMC3PR3                      1504
#define PSMC3PR4                      1505
#define PSMC3PR5                      1506
#define PSMC3PR6                      1507
#define PSMC3PR7                      1508
#define PSMC3PRH                      1509
#define PSMC3PR8                      1510
#define PSMC3PR9                      1511
#define PSMC3PR10                     1512
#define PSMC3PR11                     1513
#define PSMC3PR12                     1514
#define PSMC3PR13                     1515
#define PSMC3PR14                     1516
#define PSMC3PR15                     1517
#define PSMC3TMRL                     1518
#define PSMC3TMR0                     1519
#define PSMC3TMR1                     1520
#define PSMC3TMR2                     1521
#define PSMC3TMR3                     1522
#define PSMC3TMR4                     1523
#define PSMC3TMR5                     1524
#define PSMC3TMR6                     1525
#define PSMC3TMR7                     1526
#define PSMC3TMRH                     1527
#define PSMC3TMR8                     1528
#define PSMC3TMR9                     1529
#define PSMC3TMR10                    1530
#define PSMC3TMR11                    1531
#define PSMC3TMR12                    1532
#define PSMC3TMR13                    1533
#define PSMC3TMR14                    1534
#define PSMC3TMR15                    1535
#define PSMC3DBR                      1536
#define PSMC3DBR0                     1537
#define PSMC3DBR1                     1538
#define PSMC3DBR2                     1539
#define PSMC3DBR3                     1540
#define PSMC3DBR4                     1541
#define PSMC3DBR5                     1542
#define PSMC3DBR6                     1543
#define PSMC3DBR7                     1544
#define PSMC3DBF                      1545
#define PSMC3DBF0                     1546
#define PSMC3DBF1                     1547
#define PSMC3DBF2                     1548
#define PSMC3DBF3                     1549
#define PSMC3DBF4                     1550
#define PSMC3DBF5                     1551
#define PSMC3DBF6                     1552
#define PSMC3DBF7                     1553
#define PSMC3BLKR                     1554
#define PSMC3BLKR0                    1555
#define PSMC3BLKR1                    1556
#define PSMC3BLKR2                    1557
#define PSMC3BLKR3                    1558
#define PSMC3BLKR4                    1559
#define PSMC3BLKR5                    1560
#define PSMC3BLKR6                    1561
#define PSMC3BLKR7                    1562
#define PSMC3BLKF                     1563
#define PSMC3BLKF0                    1564
#define PSMC3BLKF1                    1565
#define PSMC3BLKF2                    1566
#define PSMC3BLKF3                    1567
#define PSMC3BLKF4                    1568
#define PSMC3BLKF5                    1569
#define PSMC3BLKF6                    1570
#define PSMC3BLKF7                    1571
#define PSMC3FFA                      1572
#define PSMC3FFA0                     1573
#define PSMC3FFA1                     1574
#define PSMC3FFA2                     1575
#define PSMC3FFA3                     1576
#define PSMC3STR0                     1577
#define P3STRA                        1578
#define P3STRB                        1579
#define PSMC3STR1                     1580
#define P3HSMEN                       1581
#define P3LSMEN                       1582
#define P3SSYNC                       1583
#define PSMC4CON                      1584
#define P4MODE                        1585
#define P4MODE0                       1586
#define P4MODE1                       1587
#define P4MODE2                       1588
#define P4MODE3                       1589
#define P4DBRE                        1590
#define P4DBFE                        1591
#define PSMC4LD                       1592
#define PSMC4EN                       1593
#define PSMC4MDL                      1594
#define P4MSRC                        1595
#define P4MSRC0                       1596
#define P4MSRC1                       1597
#define P4MSRC2                       1598
#define P4MSRC3                       1599
#define P4MDLBIT                      1600
#define P4MDLPOL                      1601
#define P4MDLEN                       1602
#define PSMC4SYNC                     1603
#define P4SYNC0                       1604
#define P4SYNC1                       1605
#define P4SYNC2                       1606
#define P4DCPOL                       1607
#define P4PRPOL                       1608
#define P4POFST                       1609
#define PSMC4CLK                      1610
#define P4CSRC0                       1611
#define P4CSRC                        1612
#define P4CSRC1                       1613
#define P4CPRE0                       1614
#define P4CPRE                        1615
#define P4CPRE1                       1616
#define PSMC4OEN                      1617
#define P4OEA                         1618
#define P4OEB                         1619
#define PSMC4POL                      1620
#define P4POLA                        1621
#define P4POLB                        1622
#define P4INPOL                       1623
#define PSMC4BLNK                     1624
#define P4REBM0                       1625
#define P4REBM                        1626
#define P4REBM1                       1627
#define P4FEBM0                       1628
#define P4FEBM                        1629
#define P4FEBM1                       1630
#define PSMC4REBS                     1631
#define P4REBSC1                      1632
#define P4REBSC2                      1633
#define P4REBSC3                      1634
#define P4REBSC4                      1635
#define P4REBSIN                      1636
#define PSMC4FEBS                     1637
#define P4FEBSC1                      1638
#define P4FEBSC2                      1639
#define P4FEBSC3                      1640
#define P4FEBSC4                      1641
#define P4FEBSIN                      1642
#define PSMC4PHS                      1643
#define P4PHST                        1644
#define P4PHSC1                       1645
#define P4PHSC2                       1646
#define P4PHSC3                       1647
#define P4PHSC4                       1648
